<a href="https://colab.research.google.com/github/2naayoon/2naayoon.github.io/blob/main/02_1_%5B%EC%8B%A4%EC%8A%B5%5D_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### [실습1]

In [ ]:
import pandas as pd

In [ ]:
data = {
    "홍길동":[88,75,95],
    "강감찬":[82,62,85],
    "김종민":[75,69,70],
    "임창정":[45,56,80]
}
df = pd.DataFrame(data, index=['java','python','basic'])
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   80

In [ ]:
# 홍길동 학생의 과목별 점수를 출력하시오

df["홍길동"]

java      88
python    75
basic     95
Name: 홍길동, dtype: int64

In [ ]:
# python 과목의 점수를 출력하시오.

df.loc["python"]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [ ]:
# 각 학생의 sql 점수를 추가하시오 [70,85,86,92]

df.loc["sql"] = [70,85,86,92]
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78
sql      70   85   86   92

In [ ]:
# basic 점수를 삭제하시오

df.drop("basic",inplace=True)
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
sql      70   85   86   92

### [실습2]

In [ ]:
df = pd.DataFrame({"미국":[2.1,2.2,2.3], "한국":[0.4,0.5,0.45], "중국":[10,13,15]})
df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [ ]:
# 인덱스와 함께 생성하기

df = pd.DataFrame({"미국":[2.1,2.2,2.3], "한국":[0.4,0.5,0.45], "중국":[10,13,15]}, index=[2019,2020,2021])
df

       미국    한국  중국
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [ ]:
#  인덱스를 출력하시오

df.index

Int64Index([2019, 2020, 2021], dtype='int64')

In [ ]:
# 컬럼명을 출력하시오.

df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [ ]:
# 전체 값들만 출력하기

df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [ ]:
# 인덱스로 특정 컬럼 선택하기

df["미국"]

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

In [ ]:
df.미국   #  이 경우는 안될수도 있음

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

In [ ]:
# 일본 컬럼 추가하기

df["일본"] = [3,4,5]
df

     년도   미국    한국  중국  일본
0  2019  2.1  0.40  10   3
1  2020  2.2  0.50  13   4
2  2021  2.3  0.45  15   5